src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ЗаявкаНаРасходДС</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Подотчет</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииРасходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПКО</name>
    <type>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПодотчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидОперацииРасходныйКассовыйОрдер/ВидОперацииРасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииРасходныйКассовыйОрдер</name>
  <enumValues>
    <name>ВыдачаВПодотчет</name>
  </enumValues>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассу</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Гривна</name>
      <description>Гривна</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>Доллар</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
  </predefined>
  <attributes>
    <name>КодЧисловой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСимвольный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/РасходныйКассовыйОрдер/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	РольКассир = ( РольДоступна ( "Кассир" ) И НЕ РольДоступна ( "ПолныеПрава" ) );
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	Иначе
		// код ...	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	ОбщийДокументы.НачальноеЗаполнение ( Объект );
	Если ( ЗначениеЗаполнено ( Параметры.Основание ) ) Тогда
		// код ...
	Иначе
		Объект.Организация = Константы.ОсновнаяОрганизация.Получить ();
		Если ( РольКассир ) Тогда
			Объект.Касса = ПараметрыСеанса.ТекущийПользователь.ОсновнаяКасса;
		Иначе
			Объект.Касса = Константы.ОсновнаяКасса.Получить ();	
		КонецЕсли;
		Объект.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.Оплата;
		Если ( Параметры.ЗначенияЗаполнения.Свойство ( "ВидОперации" ) ) Тогда
			Если ( ЗначениеЗаполнено ( Параметры.ЗначенияЗаполнения.ВидОперации ) ) Тогда
				Объект.ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
			КонецЕсли; 
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьВидимость ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении ( Элемент )
	
	установитьВидимость ();
	
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимость ()
	
	Если ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииРасходныйКассовыйОрдер.Конвертация" ) ) Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
	ИначеЕсли ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииРасходныйКассовыйОрдер.ПеремещениеВКассу" ) ) Тогда
		Элементы.ГруппаСвязанныйДокумент.Видимость = Истина;
	Иначе
		Элементы.ГруппаСвязанныйДокумент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКурсПриИзменении ( Элемент )
	
	данные = Элементы.Оплаты.ТекущиеДанные;
	Если ( Объект.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			данные.Сумма = Объект.Сумма * данные.Курс;
		КонецЕсли;
	ИначеЕсли ( Объект.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И данные.Курс <> 0 ) Тогда
			данные.Сумма =Объект.Сумма / данные.Курс;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи ( ПараметрыЗаписи )
	
	Оповестить ( "ИзменениеКассовыхДокументов", , Объект.Ссылка );	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении ( Элемент )
	
	Если ( Объект.Оплаты.Количество () = 0 ) Тогда
		новая = Объект.Оплаты.Добавить ();
		новая.Валюта = Объект.Валюта;
		новая.Курс = 1;
		новая.Сумма = Объект.Сумма;
	Иначе
		строкаТЧ = Объект.Оплаты [ 0 ];
		Если ( строкаТЧ.Валюта = Объект.Валюта ) Тогда
			строкаТЧ.Сумма = Объект.Сумма; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаПриИзменении ( Элемент )
	
	текущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	Если ( текущиеДанные <> Неопределено ) Тогда
		Если ( текущиеДанные.НомерСтроки = 1 
			И текущиеДанные.Валюта = Объект.Валюта ) Тогда
			Объект.Сумма = текущиеДанные.Сумма; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
